# 1. Створіть і виведіть на екран власний вектор з 5 елементів певного змісту:
# 1)з елементами символьного типу;
# 2)з елементами числового типу;
# 3)додайте вектор імен до елементів числового типу і виведіть на екран вектор з іменами і відповідними числовими значеннями;
# 4)об’єднайте вектори в одну структуру і виведіть результат об’єднання на екран.
 
v_char <- c("apple", "banana", "cherry", "date", "blueberry")
cat("Vector with character elements:\n", v_char)

v_num <- c(10, 20, 30, 40, 50)
cat("Vector with numeric elements:\n", v_num)

names(v_num) <- c("ten", "twenty", "thirty", "forty", "fifty")
v_num

combined_v <- list(v_char = v_char, v_num = v_num)
cat("\nCombined vector as a list:\n")
combined_v


# 2.Напишіть  код,  який  замінює  останній  елемент  будь-якого вектора  на  пропущене значення  (NA).  Ваш  код  повинен  працювати  для  вектора  будь-якої  довжини.Створіть  два  тестових  вектори  різної  довжини  і  перевірте  на  них  правильність створеного коду.

sec <- v_num
sec[length(sec)] <- NA
sec

# 3.Створіть вектор g з наступних значень:1,  0,  2,  3,  6,  8,  12,  15,  0, NA , NA ,  9,  4,  16,  2,  0. Виведіть на екран:
# -перший елемент вектора;
# -останній елемент вектора;
# -елементи вектора з третього по п’ятий включно;
# -елементи вектора, які дорівнюють 2;
# -елементи вектора, які більше 4;
# -елементи вектора, які кратні 3 (діляться на 3 без остачі);
# -елементи вектора, які більше 4 і кратні 3;
# -елементи вектора, які або менше 1, або більше 5;
# -індекси елементів, які дорівнюють 0;
# -індекси елементів, що не менше 2 і не більше 8.

g <- c(1, 0, 2, 3, 6, 8, 12, 15, 0, NA, NA, 9, 4, 16, 2, 0)
g[1]
g[length(g)]
g[3:5]
g[g == 2]
g[g > 4]
g[g %% 3 == 0]
g[g > 4 & g %% 3 == 0]
g[g < 1 | g > 5]
which(g == 0)
which(g > 2 & g <8)


# 4.Створіть повторювану послідовність з 4 елементів (перші літери Вашого прізвища та  іменілатиницею,  число  і  номер  місяця  народження).Довжина  послідовності дорівнює  Вашому  віку  (кількості  повних  років).  Якщо  першілітери  прізвища  та імені співпадають, то візьміть з них інші різні літери. Якщо збігаються число і номер місяця народження, то замістьномера місяця взяти його назву англійською мовою. 

surname <- "P"
name <- "A"
day <- 13
month <- 6
age <- 19

sequence <- rep(c(surname, name, day, month), age)
sequence

# 5.Створіть матрицю M 3 вимірності 3×4 і заповніть її трійками у найбільш швидкий спосіб. Змініть деякі елементи матриці

M <- matrix(3, nrow = 3, ncol = 4)
M
M[1,3] <- 4
M[2,1] <- 1
M[3,2] <- NA
M[3,4] <- 1
M

# 6.Створіть  матрицю  A вимірності  3×4  ізаповніть  її  випадковими  цілими  числами. Виведіть на екран матрицю B, яка отримана з матриці A множенням її першого рядка на 2, другого –на (-3), третього –на 5. У матриці B додати заголовки рядків (row1, row2, row3) та стовпців (col1, col2, col3, col4).

A <- matrix(sample(1:20, 12), nrow = 3, ncol = 4)
A
B <- matrix(c(2*A[1,], -3*A[2,], 5*A[3,]), nrow = 3, ncol = 4, byrow = TRUE, dimnames = list(c("row1", "row2", "row3"), c("col1", "col2", "col3", "col4")))
B

# 7. Створіть із векторів a,b,c матрицю таку, що-задані вектори є стовпцями матриці;-задані вектори є рядками матриці;Дайте нові назви рядкам і стовпцям отриманих матриць

a <- c(1,3,4,9,NA)
b <- c(5,6,7,0,2)
c <- c(9,10,13,1,20)

M_col <- cbind(a,b,c)
M_col
M_row <- rbind(a,b,c)
M_row

M_new <- M_row
colnames(M_new) <- c("A","B","C","D","E")
rownames(M_new) <- c("First", "Second", "Third")
M_new

# 8.Створіть тривимірний масив даних для аналізу успішності студентів ФІТ (3 групи, 5 дисциплін, 4 категорії оцінок). Наприклад, FIT, Group 1PhilosophyJurisprudenceForeign languageOffice computer technologyAlgorithmization and programmingunsatisfactory10253satisfactory8153208good161510513excellent501506...

subjects <- c("Philosophy", "Jurisprudence", "Foreign language", "Office computer technology", "Algorithmization and programming")
grades <- c("unsatisfactory", "satisfactory", "good", "excellent")
groups <- c("FIT, Group1","FIT, Group2","FIT, Group3" )

G <- c(1,8,16,5,0,15,15,0,2,3,10,15,5,20,5,0,3,8,13,6,
       14,13,17,2,16,6,12,15,1,3,18,9,7,20,17,18,4,19,10,16,
       15,6,9,2,1,20,16,15,3,10,4,5,3,10,4,5,18,7,14,8)
R <- array(G, dim = c(4, 5, 3), dimnames = list(grades,subjects,groups))
R

# 9.
# 1)Створіть з векторів із заданих векторів список (list) і назвіть його info.
# 2)Звертаючись до елементів списку, виведіть на екран ім'я Michael.
# 3)Звертаючись до елементів списку, виведіть на екран вектор gender.
# 4)Переназвіть вектори в списку Name, Age, Gender. 
# 5)Виведіть на екран елементи вектора Name.
# 6)Додайте до списку вектор drinks, в якому збережені значення: juice, tea, rum, coffee.
# 7)Додайте до списку дані ще однієї людини: John, 2 роки, чоловіча стать, любить молоко.Виведіть оновлений список на екран


Names <- c("Jane", "Michael", "Mary", "George")
Age <- c(8, 6, 28, 45)
Gender <- c(0, 1, 0, 1)
info <- list(names = Names, age = Age, gender = Gender)
info

cat("2.Name:", info[[1]][2])
cat("3.Genders", info[[3]])
names(info) <- c("Names", "Age", "Gender")
info
cat("5.All names:", info[[1]])

info[[4]] <- c("juice", "tea", "rum", "coffee")
names(info[3])
str(info)

info[4]
info[[1]][5] <- "John"
info[[2]][5] <- 2
info[[3]][5] <- 1
info[[4]][5] <- "milk"
info

# 10.Створіть новий data.frame під назвою mini_mtcars, в якому будуть збережені тільки 
#               третій, сьомий, десятий, дванадцятийі останній рядок датафрейма mtcars.'

mtcars
mini_cars <- mtcars[c(3, 7, 10, 12, nrow(mtcars)), ]
mini_cars